robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
                /* Full recovery: unmount + USB host restart + wait READY + remount */
                UsbFsService_Unmount();
                UsbMscService_ForceRestart();

                {
                    uint32_t t_wait = HAL_GetTick();
                    while (UsbMscService_IsReady() == 0U)
                    {
                        UsbMscService_Process();
                        if ((HAL_GetTick() - t_wait) > 10000U)
                        {
                            printf("[CHUNK] recovery timeout waiting for READY\n");
                            break;
                        }
                    }
                }

                if (UsbMscService_IsReady() != 0U)
                {
                    if (UsbFsService_Mount() != USB_FS_RESULT_OK)
                    {
                        printf("[CHUNK] remount FAILED fatfs=%lu\n",
                               (unsigned long)UsbFsService_GetLastError());
                    }
                    else
                    {
                        printf("[CHUNK] recovery OK -> remounted\n");
                    }
                }
            }
        }

        if (result != USB_FS_RESULT_OK)
        {
            printf("[CHUNK] block %lu offset=%lu FAILED after %u retries  result=%u fatfs=%lu\n",
                   (unsigned long)block_num,
                   (unsigned long)offset,
                   (unsigned int)CHUNKED_READ_MAX_RETRIES,
                   (unsigned int)result,
                   (unsigned long)UsbFsService_GetLastError());
            return;
        }

        if (bytes_read != to_read)
        {
            printf("[CHUNK] block %lu offset=%lu short read: expected=%lu got=%lu\n",
                   (unsigned long)block_num,
                   (unsigned long)offset,
                   (unsigned long)to_read,
                   (unsigned long)bytes_read);
            return;
        }

        crc     = crc32_update(crc, chunk, bytes_read);
        offset += bytes_read;
        block_num++;

        /* Pausa entre bloques para estabilizar el controlador USB */
        if (offset < file_size)
        {
            HAL_Delay(CHUNKED_READ_INTER_BLOCK_DELAY_MS);
        }

        /* Progreso cada 2 bloques */
        if ((block_num & 1U) == 0U)
        {
            printf("[CHUNK] %lu / %lu bytes (%lu%%)\n",
                   (unsigned long)offset,
                   (unsigned long)file_size,
                   (unsigned long)((offset * 100U) / file_size));
        }
    }

    uint32_t elapsed = HAL_GetTick() - t_start;

    printf("[CHUNK] %s: %lu bytes  CRC32=%08lX  expected=%08lX  %s  %lu ms  retries=%lu\n",
           bin_path,
           (unsigned long)offset,
           (unsigned long)crc,
           (unsigned long)expected_crc32,
           (crc == expected_crc32) ? "MATCH" : "MISMATCH",
           (unsigned long)elapsed,
           (unsigned long)total_retries);
}

/* Lee app_int.bin por chunks desde USB, graba en flash interna y verifica.
 * Usa el mismo buffer estático que ReadBinChunkedTest (no llamar en paralelo). */
static void FlashAppIntTest(uint32_t expected_crc32)
{
    static uint8_t chunk[CHUNKED_READ_BLOCK_SIZE];
    UsbFsResult_t  result;
    BootFlashResult_t flash_result;
    uint32_t       file_size = 0U;
    uint32_t       offset    = 0U;
    uint32_t       bytes_read;
    uint32_t       to_read;
    uint32_t       retry;
    uint32_t       block_num = 0U;
    uint32_t       t_start;

    printf("[FTEST] === Flash app_int.bin test ===\n");

    /* 1. Get file size */
    result = UsbFsService_GetFileSize(USB_UPDATE_APP_INT_BIN, &file_size);
    if (result != USB_FS_RESULT_OK)
    {
        printf("[FTEST] GetFileSize FAILED result=%u\n", (unsigned int)result);
        return;
    }
    printf("[FTEST] file size=%lu bytes\n", (unsigned long)file_size);

    /* 2. Erase app area */
    printf("[FTEST] erasing flash...\n");
    flash_result = BootFlash_EraseAppArea(file_size);
    if (flash_result != BOOT_FLASH_OK)
    {
        printf("[FTEST] erase FAILED result=%u\n", (unsigned int)flash_result);
        return;
    }

    /* 3. Read from USB and program chunk by chunk */
    printf("[FTEST] programming flash...\n");
    t_start = HAL_GetTick();

    while (offset < file_size)
    {
        to_read = file_size - offset;
        if (to_read > CHUNKED_READ_BLOCK_SIZE)
        {
            to_read = CHUNKED_READ_BLOCK_SIZE;
        }

        /* Read chunk from USB with retry + recovery */
        bytes_read = 0U;
        for (retry = 0U; retry <= CHUNKED_READ_MAX_RETRIES; retry++)
        {
            result = UsbFsService_ReadFile(USB_UPDATE_APP_INT_BIN, chunk, offset, to_read, &bytes_read);
            if (result == USB_FS_RESULT_OK)
            {
                break;
            }
            if (retry < CHUNKED_READ_MAX_RETRIES)
            {
                printf("[FTEST] read offset=%lu RETRY %lu/%u -> recovery\n",
                       (unsigned long)offset,
                       (unsigned long)(retry + 1U),
                       (unsigned int)CHUNKED_READ_MAX_RETRIES);

                UsbFsService_Unmount();
                UsbMscService_ForceRestart();
                {
                    uint32_t t_wait = HAL_GetTick();
                    while (UsbMscService_IsReady() == 0U)
                    {
                        UsbMscService_Process();
                        if ((HAL_GetTick() - t_wait) > 10000U)
                        {
                            printf("[FTEST] recovery timeout\n");
                            break;
                        }
                    }
                }
                if (UsbMscService_IsReady() != 0U)
                {
                    (void)UsbFsService_Mount();
                }
            }
        }

        if (result != USB_FS_RESULT_OK)
        {
            printf("[FTEST] read FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        /* Program chunk into flash */
        flash_result = BootFlash_Program(APP_BASE + offset, chunk, bytes_read);
        if (flash_result != BOOT_FLASH_OK)
        {
            printf("[FTEST] program FAILED at offset=%lu result=%u\n",
                   (unsigned long)offset, (unsigned int)flash_result);
            return;
        }

