robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
        /* Verify chunk immediately */
        flash_result = BootFlash_Verify(APP_BASE + offset, chunk, bytes_read);
        if (flash_result != BOOT_FLASH_OK)
        {
            printf("[FTEST] verify FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        offset += bytes_read;
        block_num++;

        printf("[FTEST] %lu / %lu bytes (%lu%%)\n",
               (unsigned long)offset,
               (unsigned long)file_size,
               (unsigned long)((offset * 100U) / file_size));

        if (offset < file_size)
        {
            HAL_Delay(CHUNKED_READ_INTER_BLOCK_DELAY_MS);
        }
    }

    uint32_t elapsed = HAL_GetTick() - t_start;

    /* 4. CRC32 over flash */
    {
        uint32_t crc_flash = 0U;
        crc_flash = crc32_update(crc_flash, (const uint8_t *)APP_BASE, file_size);

        printf("[FTEST] flash CRC32=%08lX  expected=%08lX  %s\n",
               (unsigned long)crc_flash,
               (unsigned long)expected_crc32,
               (crc_flash == expected_crc32) ? "MATCH" : "MISMATCH");
    }

    /* 5. Validate app image */
    printf("[FTEST] Boot_IsApplicationValid: %s\n",
           Boot_IsApplicationValid(APP_BASE) ? "VALID" : "INVALID");

    printf("[FTEST] done in %lu ms\n", (unsigned long)elapsed);

#if BOOT_FLASH_JUMP_AFTER_PROGRAM
    if (Boot_IsApplicationValid(APP_BASE))
    {
        printf("[FTEST] jumping to app...\n");
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        HAL_Delay(100U);
        Boot_JumpToApplication(APP_BASE);
    }
#endif
}

static void UsbFsMountTestLoop(void)
{
    UsbMscState_t last_state;
    UsbFsResult_t mount_result;

    printf("[TEST] USB FS mount test enabled\n");

    UsbMscService_Init();
    UsbMscService_SetEnabled(1U);
    UsbFsService_Init();

    last_state = UsbMscService_GetState();
    printf("[TEST] USB state: %s\n", UsbMscService_GetStateName());

    while (1)
    {
        UsbMscService_Process();

        if (UsbMscService_GetState() != last_state)
        {
            last_state = UsbMscService_GetState();
            printf("[TEST] USB state: %s\n", UsbMscService_GetStateName());

            if (last_state == USB_MSC_STATE_READY)
            {
                static const char * const probe_paths[4] =
                {
                    USB_UPDATE_APP_INT_BIN,
                    USB_UPDATE_APP_OSPI_BIN,
                    USB_UPDATE_APP_INT_CRC,
                    USB_UPDATE_APP_OSPI_CRC
                };
                uint32_t i;
                UsbFsResult_t stat_result;
                uint8_t all_present;

                printf("[TEST] MSC ready -> attempting f_mount\n");
                mount_result = UsbFsService_Mount();

                if (mount_result != USB_FS_RESULT_OK)
                {
                    printf("[TEST] f_mount FAILED result=%u fatfs_err=%lu\n",
                           (unsigned int)mount_result,
                           (unsigned long)UsbFsService_GetLastError());
                }
                else
                {
                    printf("[TEST] f_mount OK\n");

                    {
                        FATFS  *fs_ptr;
                        DWORD   free_clust;
                        if (f_getfree("0:", &free_clust, &fs_ptr) == FR_OK)
                        {
                            printf("[TEST] sector=%u bytes  cluster=%u sectors (%lu bytes)\n",
                                   (unsigned int)FF_MAX_SS,
                                   (unsigned int)fs_ptr->csize,
                                   (unsigned long)((uint32_t)fs_ptr->csize * FF_MAX_SS));
                        }
                    }

                    stat_result = UsbFsService_FileExists(USB_UPDATE_DIR_PATH);
                    printf("[TEST] f_stat dir %s -> %s (fatfs_err=%lu)\n",
                           USB_UPDATE_DIR_PATH,
                           (stat_result == USB_FS_RESULT_OK) ? "OK" : "NOT FOUND",
                           (unsigned long)UsbFsService_GetLastError());

                    all_present = 1U;
                    for (i = 0U; i < 4U; i++)
                    {
                        stat_result = UsbFsService_FileExists(probe_paths[i]);
                        printf("[TEST] f_stat %s -> %s (fatfs_err=%lu)\n",
                               probe_paths[i],
                               (stat_result == USB_FS_RESULT_OK) ? "OK" : "NOT FOUND",
                               (unsigned long)UsbFsService_GetLastError());
                        if (stat_result != USB_FS_RESULT_OK)
                        {
                            all_present = 0U;
                        }
                    }

                    if (all_present != 0U)
                    {
                        uint32_t fsize_tmp;
                        if (UsbFsService_GetFileSize(USB_UPDATE_APP_INT_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
                            printf("[TEST] %s size=%lu bytes\n", USB_UPDATE_APP_INT_BIN, (unsigned long)fsize_tmp);
                        if (UsbFsService_GetFileSize(USB_UPDATE_APP_OSPI_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
                            printf("[TEST] %s size=%lu bytes\n", USB_UPDATE_APP_OSPI_BIN, (unsigned long)fsize_tmp);

                        static const char * const crc_paths[2] =
                        {
                            USB_UPDATE_APP_INT_CRC,
                            USB_UPDATE_APP_OSPI_CRC
                        };
                        uint8_t  crc_buf[16];
                        uint32_t bytes_read;
                        UsbFsResult_t read_result;

                        uint32_t expected_crc[2] = { 0U, 0U };

                        printf("[TEST] all 4 files present\n");

                        /* Leer los dos .crc y parsear el valor hex ASCII */
                        for (i = 0U; i < 2U; i++)
                        {
                            bytes_read  = 0U;
                            read_result = UsbFsService_ReadFile(crc_paths[i],
                                                                crc_buf,
                                                                0U,
                                                                sizeof(crc_buf),
                                                                &bytes_read);
                            if (read_result == USB_FS_RESULT_OK)
                            {
                                uint32_t val = 0U;
                                uint32_t k;

                                for (k = 0U; k < bytes_read; k++)
                                {
                                    uint8_t c = crc_buf[k];
                                    if ((c >= '0') && (c <= '9'))
                                        val = (val << 4) | (uint32_t)(c - '0');
                                    else if ((c >= 'A') && (c <= 'F'))
                                        val = (val << 4) | (uint32_t)(c - 'A' + 10);
                                    else if ((c >= 'a') && (c <= 'f'))
                                        val = (val << 4) | (uint32_t)(c - 'a' + 10);
                                    else
                                        break;
                                }
                                expected_crc[i] = val;
                                printf("[TEST] %s -> 0x%08lX\n",
                                       crc_paths[i], (unsigned long)val);
                            }
                            else
                            {
                                printf("[TEST] read %s FAILED result=%u fatfs_err=%lu\n",
                                       crc_paths[i],
                                       (unsigned int)read_result,
                                       (unsigned long)UsbFsService_GetLastError());
                            }
                        }

                        /* Leer los dos .bin con chunked reopen y verificar CRC32 */
                        ReadBinChunkedTest(USB_UPDATE_APP_INT_BIN,  expected_crc[0]);
                        /* ReadBinChunkedTest(USB_UPDATE_APP_OSPI_BIN, expected_crc[1]); */

                        /* Test: grabar app_int.bin en flash interna y verificar */
                        FlashAppIntTest(expected_crc[0]);
                    }
                    else
                    {
                        printf("[TEST] one or more files missing\n");
                    }
                }
            }
            else if (last_state == USB_MSC_STATE_IDLE)
            {
                printf("[TEST] device disconnected -> unmounting\n");
                UsbFsService_Unmount();
            }
        }
    }
}

/* -----------------------------------------------------------------------
 * SystemPower_Config
 *   Same supply configuration as the application.
 * ----------------------------------------------------------------------- */
static void SystemPower_Config(void)
{
    if (HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY) != HAL_OK)
    {
        Error_Handler();
    }
}

/* -----------------------------------------------------------------------
 * SystemClock_Config
 *   Keep SYSCLK on HSI for stable bring-up, but enable HSE + PLL1 so the
 *   USB PHY can use a valid dedicated clock source.
 * ----------------------------------------------------------------------- */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSIState       = RCC_HSI_ON;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMBOOST  = RCC_PLLMBOOST_DIV2;
    RCC_OscInitStruct.PLL.PLLM       = 5;
    RCC_OscInitStruct.PLL.PLLN       = 64;
    RCC_OscInitStruct.PLL.PLLP       = 10;
    RCC_OscInitStruct.PLL.PLLQ       = 2;
    RCC_OscInitStruct.PLL.PLLR       = 2;
    RCC_OscInitStruct.PLL.PLLRGE     = RCC_PLLVCIRANGE_0;
    RCC_OscInitStruct.PLL.PLLFRACN   = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

